#+TITLE: pomodora techniques
#+DESCRIPTION: RT
#+STARTUP: overview
* DONE test item1 
  CLOSED: [2017-02-02 Thu 22:56]
  CLOCK: [2017-01-13 Fri 16:56]--[2017-01-13 Fri 16:57] =>  0:01
  CLOCK: [2017-01-13 Fri 16:42]--[2017-01-13 Fri 16:55] =>  0:13
  


* DONE workflow test
  CLOSED: [2017-02-02 Thu 22:56]
- select a TODO task. 
- run org-start-pomodora
- auto record each pomodora
- allow org-intercept-pomodora
- utilize the table 


* DONE sample task 
  CLOSED: [2017-02-02 Thu 22:56]
  CLOCK: [2017-01-15 Sun 20:57]--[2017-01-15 Sun 20:58] =>  0:01



#+BEGIN: clocktable :maxlevel 2 :scope subtree
#+CAPTION: Clock summary at [2017-01-15 Sun 20:58]
| Headline         | Time   |
|------------------+--------|
| *Total time*     | *0:01* |
|------------------+--------|
| TODO sample task | 0:01   |
#+END:



| <25> task name            | <25>  status              |
|---------------------------+---------------------------|
| test1                     | [X][X][.][X]              |
| test2                     | [X]                       |
|                           |                           |




* DONE MSR comparison
  CLOSED: [2017-02-02 Thu 22:56]

* DONE emacs pomodora project 
  CLOSED: [2017-02-02 Thu 22:56]

* DONE eval 
  CLOSED: [2017-02-02 Thu 22:56]






* DONE MSR wgted avg
  CLOSED: [2017-02-02 Thu 22:56]


* TODO MISC
this is a place holder

* summary table 
  :PROPERTIES:
  :VISIBILITY: all
  :END:
#+Name: pomodora
|       date | item                             | status             |
|------------+----------------------------------+--------------------|
| 2017-01-24 | TODO MSR comparison              | [X][X][X][X][X][X] |
| 2017-01-24 | TODO emacs pomodora project      | [X]                |
| 2017-01-25 | TODO MSR comparison              | [X][X][X][X]       |
| 2017-01-26 | TODO MSR wgted avg               | [X][X][X][X]       |
| 2017-01-30 | TODO MSR comparison              | [X][X][X][X]       |
| 2017-02-01 | TODO plan new work to do         | [X][X][X]          |
| 2017-02-02 | TODO add documentation to precog | [X][X][X][X]       |





